resume_dict = {
    "first_name": "Александр",
    "last_name": "Криминецкий",
    "expected_position": "Lead / Senior Backend Engineer",
    "email": "Kriminetz0810@gmail.com",
    "tel": "+79082052839",
    # "website" : "aKriminetskiy.tk",
    "website": "https://kriminetskii.streamlit.app",
    # "expected_salary": "",
    # "photo" : "https://cdn-icons-png.flaticon.com/512/912/912214.png",
    # "photo" : "https://cdn4.telegram-cdn.org/file/NxOGSQsiO05a9PFOwtFpI5dJpWyiVai6uJ87HqR7JiN4AVcZO4cDWcusdImsEQfvcIc_JVsVvP8jPL6PGkFisRK647J8DZU7G3-UtsYHZuDmqYnGDZy3zbeHMuB29eGeFzyBDmeFXpMT6V8qzd8lYabwwOJc6lntfQvohLRvRS3-bOyFeRlLDCXAyRb7uT-266FXhwjz8AHwPSmnL2efVO1baVFdmHa3kf8GP3Jzif4-wInsg_X2p9N1Wu-WHscajsY86r1Q7e4LY8VBzyVG_F5HhERgqSLZUHTSznZqKMTG6fe-Yn2hueSS2SK5MT0tkkAIe0mO2kb8jfmOoTJ36Q.jpg",
    "photo": "static/me.jpg",
    "about" : """
Backend-разработчик с 9+ лет опыта в проектировании, создании и масштабировании надежных систем.
Обладаю глубоким знанием Python и DevOps, для проектирования архитектуры использую C4 model.

Технологически агностичен: хотя и есть предпочтительный стек (Python/PostgreSQL/React), готов работать с любыми языками и технологиями, которые требуются задаче — будь то Go, Kotlin, Flutter или другие.
Имею опыт в FinTech, Retail и Geospatial сферах, строю системы на основе микросервисной архитектуры и облачных технологий.

Доказал способность вести проекты с нуля до продакшена с генерацией выручки.
Осуществлял техническое лидерство: внедрял стандарты качества, настраивал процессы и обеспечивал бесперебойную работу систем.

Мой подход к разработке основан на приоритете бизнес-целей: любой код существует для обслуживания бизнеса и создания ценности.
Предпочитаю сделать решение "достаточно хорошо" и быстро выпустить в релиз для сбора обратной связи, чем стремиться к идеалу, который замедляет частоту релизов — ключевую метрику успеха команды.

При этом дотошно отношусь к качеству: внедряю автотесты, статический анализ и code review, требую от коллег соблюдения высоких стандартов.
Готов решать сложные архитектурные задачи и заниматься наставничеством менее опытных разработчиков.   
""",

# С удовольствием расспрошу на собеседовании о том как простоен процесс разработки и особенно почему он был выбран, как собираются требования для разработки, как происходит планирование, разработка архитектуры и управление рисками. Считаю что правильное выстраивание процесса и частота релизов - основные ценности любой команды.

# Обожаю статические анализаторы и дополнительные проверки в коде. mypy, black, flake8, radon, cerberus - то чем постоянно пользуюсь. Считаю, если в программе есть тысяча валидаторов - это отличный повод поставить тысяча первый.

# Расскажу и про магические методы, и про event loop и про gil и про модель качества iso.

# В список навыков к сожалению нелься уместить весь свой стэк по этому пропишу его также здесь:

# Python, aiohttp, django, django-rest-framework, FastAPI, porstgreSQL, mongodb, oracledb, celery, rabbitmq, kafka, redis, docker, docker-compose, OpenShift, linux bash, JWT, Elasticsearch, Locust, Wagtail, NetworkX, treebeard,  prometheus, grafana, thrift, GraphQL, grpc, git, gitlab-ci, TeamCity, falcon, pytest/unittest, xpath, aws s3, PyQt, flask, ansible, numpy/pandas/geoPandas, matlotlib, GDAL, ibmmq, node-red, Rasterio, Shapely, Fiona, QGis, GeoServer, graphviz(dot), plantuml, openapi/swagger, aiopg, sqlalchemy, alembic

#     "about": """
# Backend-разработчик с 9+ лет опыта проектирования, создания и масштабирования надежных систем, с глубоким пониманием Python и DevOps, для архитектуры использую C4 model.
# Технологически агностичен: использую любые языки программирования и технологии какие попросят, хоть и имею любимый привычный стэк.
# Специальзируюсь на областях FinTech, Retail, Geospatial, опираюсь на микросервисную архитектуру и использование облачных технологий.
# Доказанный опыт в ведении проекта проект с нуля до продакшна и генерации выручки.
# Успешно осуществлял техническое лидерство, внедрял стандарты качества и обеспечивал бесперебойную работу системы.
# Подхожу к разработке с приоритетом целей бизнеса: любой код существует чтобы обслуживать цели бизнеса и генерировать ценность.
# Предпочитаю сделать "достаточно хорошо" и поскорее выпустить в релиз для быстрого сбора обратной связи, чем стараться сделать всё "идеально", что замедляет частоту релизов - главную метрику успеха команды разработки.
# Дотошно отношусь к качеству программного продукта, опираюсь как на автотесты так и на статический анализ и code review, настаиваю коллегам на соблюдение высокой планки качества.
# Готов к решению сложных архитектурных задач и наставничеству менее опытных коллег.
# """,
#     "about": """
# Ориентированный на бизнес-цели технический специалист, 

# Изучаю рынок и реальных пользователей до написания строчки кода

# Предпочитаю сделать "достаточно хорошо" и поскорее выпустить в релиз для быстрого сбора обратной связи, чем стараться сделать всё "идеально"

# Строго и дотошно отношусь к качеству программного продукта

# Доказанно могу довести проект с нуля до продакшна

# Выполняю роль технического лидера  и наставника

# Приоритезирую фичи которые генерируют выручку и избегаю недокументированной сложности создающей информационные островки и замедляющей релизы.

# Убеждён что качество работы команды измеряется частотой релизов

# Уверен что продуктовые решения лежат в зоне ответственности бизнеса, а не разработки, по этому разрабатываю то что попросили а не то что "лучше", но как технический эксперт обязан предупредить о рисках, перевожу технические ограничения и техолг на язык бизнеса.

# Люблю метрики, то что нельзя измерить - нельзя контроллиовать, сначала сделаю изначальные замеры "как есть" прежде чем предлагать улучшения.

# ### Я строю то, что просит бизнес, но как технический эксперт оцениваю риски в бизнес-терминах. Фокус на измеримых результатах — внедряю аналитику и A/B тесты чтобы проверять что действительно работает. Выступая за "достаточно хорошие" решения, я оцениваю влияние технического долга на будущую скорость. Моя ценность — в переводе между техническими ограничениями и бизнес-целями, чтобы строить устойчиво но быстро.

# ### Бизнес-ориентированный инженер, убежденный что код должен приносить бизнес-ценность. Фокус на измеримых результатах — устанавливаю четкие метрики успеха для каждой фичи и приоритезирую быстрые итерации на основе реального пользовательского фидбека. Балансирую скорость реализации и устойчивое качество, чтобы строить то что дает реальные результаты, а не техническое совершенство.

# ### Я подхожу к разработке через бизнес-призму: код существует для обслуживания бизнес-целей и генерации ценности. До начала разработки я определяю как будет выглядеть успех в измеримых показателях — будь то рост конверсии, вовлеченности пользователей или выручки.

# ### Я выступаю за "достаточно хорошие" начальные решения которые быстро достигают пользователей, потому что реальный фидбек часто показывает что нужно строить нечто иное чем изначально предполагалось. При этом я сохраняю качественный фундамент с первого дня, понимая что устойчивая скорость зависит от чистого и поддерживаемого кода.

# ### Моя философия проста: строить то что нужно бизнесу, измерять что работает, и итерироваться на основе результатов. Я считаю что команды разработки должны оцениваться по способности часто и предсказуемо доставлять бизнес-ценность.

# ### Бизнес-ориентированный инженер, убежденный что код должен приносить бизнес-ценность. Технологически агностичен с глубоким опытом в Python, но одинаково комфортно работаю с Go, Kotlin, React и Flutter. Выбираю инструменты исходя из бизнес-потребностей — использую привычные стеки для скорости когда возможно, но легко осваиваю новые технологии когда этого требуют задачи. Фокус на измеримых результатах и устойчивом качестве вместо технических предпочтений.

# ### Я подхожу к разработке через бизнес-призму, а не технологическую. Имея глубокий опыт в Python и предпочитая его для быстрой разработки, я остаюсь технологически агностичным. Я строил сервисы на Go, веб-интерфейсы на React, мобильные приложения на Flutter и инфраструктуру с различными DevOps-инструментами — всегда выбирая правильный инструмент для задачи вместо навязывания предпочтений.

# Эта гибкость проистекает из убеждения что бизнес-результаты важнее технологических стеков. Если проект требует изучения нового языка или фреймворка, я вижу в этом возможность а не препятствие. Моя ценность — в эффективном решении бизнес-проблем, будь то использование привычных инструментов для скорости или освоение новых для специфических требований вроде нагрузок или предпочтений команды.

# ### Мой подход к техническому лидерству основан на прозрачности и осознанном принятии решений. На вопрос "как нам построить X?" я предоставляю полный спектр решений которые могу представить — от быстрых прототипов до масштабируемых архитектур — с честной оценкой сложности реализации и компромиссов.

# Я понимаю что некоторые варианты могут быть непрактичными или излишне дорогими; моя цель не в продвижении конкретного подхода, а в обеспечении стейкхолдеров полным контекстом для принятия бизнес-ориентированных решений. Финальный выбор остаётся за теми кто отвечает за бизнес-результаты, тогда как моя ответственность — эффективное исполнение выбранного пути.

# //
# Senior Backend Engineer with 9+ years of expertise in designing, building, and scaling robust Python-based systems.
# Specializes in translating business requirements into efficient, well-architected solutions using the C4 model, with a rigorous focus on software quality through comprehensive testing and static analysis.
# Combines backend development with DevOps practices to streamline delivery and reliability. Proven in leading backend teams to execute technical strategy and solve core business problems that drive measurable impact.


# ###################################################
# ... сколько лет опыта и кто таков.
# ... про технологии:
# ... про основной опыт:
# ... про проект с нуля до прода:
# ... про лидерство:
# ... про деввопс: (пока не понятно)
# ... про значимые измеримые достижения: (пока не понятно)
# ... про дотошность качества кода: (пока не понятно)


# Backend-разработчик с 9+ лет опыта проектирования, создания и масштабирования надежных систем, с глубоким пониманием Python и DevOps, для архитектуры использую C4 model.
# Технологически агностичен: использую любые языки программирования и технологии какие попросят, хоть и имею любимый привычный стэк.
# Специальзируюсь на областях FinTech, Retail, Geospatial, опираюсь на микросервисную архитектуру и использование облачных технологий.
# Доказанный опыт в ведении проекта проект с нуля до продакшна и генерации выручки.
# Успешно осуществлял техническое лидерство, внедрял стандарты качества и обеспечивал бесперебойную работу системы.
# Подхожу к разработке с приоритетом целей бизнеса: любой код существует чтобы обслуживать цели бизнеса и генерировать ценность.
# Предпочитаю сделать "достаточно хорошо" и поскорее выпустить в релиз для быстрого сбора обратной связи, чем стараться сделать всё "идеально", что замедляет частоту релизов - главную метрику успеха команды разработки.
# Дотошно отношусь к качеству программного продукта, опираюсь как на автотесты так и на статический анализ и code review, настаиваю коллегам на соблюдение высокой планки качества.
# Готов к решению сложных архитектурных задач и наставничеству менее опытных коллег.

# Специализируется на преобразовании бизнес-требований в эффективные, хорошо спроектированные решения с использованием модели C4, уделяя особое внимание качеству программного обеспечения посредством тестирования и статического анализа.
# Сочетает разработку бэкенда с практиками DevOps для оптимизации доставки и повышения надежности. Имеет опыт руководства командами бэкенда для реализации технической стратегии и решения ключевых бизнес-задач, обеспечивающих измеримый результат.

# Вот мои рабочие принципы и убеждения:
# +
# +
# + Предпочитаю сделать "достаточно хорошо" и поскорее выпустить наработки в релиз для быстрого сбора обратной связи, чем стараться сделать всё "идеально"
# + Уверен что продуктовые решения лежат в зоне ответственности бизнеса, а не разработки, по этому разрабатываю то что попросили а не то что "лучше", но как технический эксперт обязан предупредить о рисках, перевожу технические ограничения и техолг на язык бизнеса.
# + 


# Backend-разработчик с 9+ лет опыта проектирования, создания и масштабирования надежных систем, с глубоким пониманием Python и DevOps. ✅
# Специализируюсь на микросервисной архитектуре, PostgreSQL (оптимизация сложных запросов, шардинг) и Kubernetes.
# Основной опыт — в fintech (платежные системы, транзакционные ядра).
# Значимые достижения: перепроектировал ключевой сервис расчетов, что повысило его доступность с 99.5% до 99.99% и позволило обрабатывать пиковые нагрузки в 10k RPS.
# Постоянно уделяю внимание качеству кода, покрытию тестами и эффективности алгоритмов.
# Готов к решению сложных архитектурных задач и наставничеству менее опытных коллег.

# """,
    "contacts": [
        {
            "name": "telegram",
            "icon": "https://moscowteslaclub.ru/images/icons/telegram-color.svg?v6",
            "link": "https://t.me/AlexKrimi",
            "text": "telegram: @AlexKrimi",
            "emojii_prefix": "📱",
        },
        {
            "name": "linkedin",
            "icon": "https://www.tdcanadatrust.com/images/evergreen/icons/32x32/linkedin.png",
            "link": "https://www.linkedin.com/in/alexandr-Kriminetsky-128309159",
            "text": "linkedin: Alexandr Kriminetskiy",
            "emojii_prefix": "🪪",
        },
        {
            "name": "planerka",
            "icon": "https://www.tdcanadatrust.com/images/evergreen/icons/32x32/linkedin.png",
            "link": "https://planerka.app/alex-krimi-ur5i7e/30min",
            "text": "Созвониться на 30 минут",
            "emojii_prefix": "📆",
        },
    ],
    "exp": [
        {
            # ❌❌
            "company_name": "UMI Technologies Corp. (Филиппины)",
            "company_contacts": "umi.ph",
            "company_contacts_link": "https://umi.ph",
            "work_start_date": "10-2022",
            "work_end_date": "11-2025",
            "position_name": "Senior/Lead Backend Engineer",
            "description": """
            UMI - Филиппинский финтех стартап и онлайн сервис с мобильным приложением - аггрегатор BNPL и кредитных услуг на Филиппинах.
            Как первый технический сотрудник, заархитектурил и реализовал многосервисную систему, выполняющую основной прибыльный функционал бизнеса, с нуля до продакшна;
            Реализовал техническую концепцию и инфраструктуру системы, приносящей доход.(За первые две недели компания одобрила кредиты на сумму 1 млн песо.).
            Руководил процессом найма технических специалистов: отбор, собеседования и принятие решений о выборе кандидатов на инженерные должности.
            Руководил масштабированием команды от одного разработчика до более чем 3 инженеров, внедряя процессы разработки и методы наставничества.
            Способствовал повышению технического совершенства в рамках межфункционального взаимодействия, установив стандарты качества, принятые командами, занимающимися бэкендом, мобильными приложениями и аналитикой.
            Подготовил фирму к привлечению инвестиций с помощью исчерпывающей технической документации и материалов для due diligence.
            Масштабировал систему для поддерки множества партнеров до закрытия фирмы в конце 2025 года.
            """,
            "action_points": [
                "Architected and implemented the core ~20 backend services successfully working in production",  # Что заархитектурил и придумал
                # "", # Что разработал с нуля до прода
                "Провёл ~50 технических интервью, было нанято 4 разработчика",  # Как нанимал людей
                "Оказывал наставническую поддержку, помогал в решении технических проблем, консультировал менее опытных в техническом плане коллег и обучал новым навыкам",  # Как менторил менее опытных коллег
                "Разработал и внедрил чат-бота LLM на основе знаний о продукте для технической поддержки, используя конвейер RAG, встраивание qwen и индексирование FIASS",  # Как пилил RAG
                "Внедрил контроль качества и мониторинг ошибок в процесс разраьботки",  # Как внедрил процессы контроля качества и слежки за ошибками
                "Выполнял работу Backend, Fullstack, и DevOps инженераа: от прототипа до продакшна, включая настройку инфраструктуры, CI/CD, мониторинг и механизмы отказоустойчивости",  # Как был dev ops и SysAdmin
                "Устранил узкие места при развёртывании создав полностью автоматизированный CI/CD пайплайн с нуля, сократив релизый цикл команды разработки",  # Переписать
                "Обеспечил доверие инвесторов с помощью исчерпывающей технической документации и материалов для due diligence, охватывая system architecture, security protocols, и disaster recovery strategies",  # Как делал архитектурную документацию и Due Dillifence
                "Проводил нагрузочное тестирование с подготовкой инфраструктуры и презентовал результаты бизнесу",  # Как делал НТ и вкручивал мониторинг
                # -------------------
                # "Transformed business requirements into a scalable technical reality by designing and implementing a microservices architecture that handled 10+ backend services, enabling parallel development and system resilience.",
                # "Eliminated deployment bottlenecks by creating a fully automated CI/CD pipeline from scratch, reducing release cycles from days to hours and enabling the team to ship features reliably and frequently.",
                # "Increased system reliability by 40% through implementing comprehensive monitoring, alerting, and quality gates, dramatically reducing production incidents and mean time to resolution.",
                # "Accelerated team productivity and code quality by instituting code review practices, test automation standards, and mentoring programs, enabling the successful onboarding and growth of new team members.",
                # "Secured investor confidence by producing exhaustive technical documentation for due diligence, covering system architecture, security protocols, and disaster recovery strategies.",
                # "Extended platform capabilities with AI-powered features using RAG architecture, demonstrating ability to integrate cutting-edge technologies to solve business problems."
                # # ###
                # "Created the backend of the system, each of ~10 BE services",
                # "Deployed into production, system handles operations of 9 shops & 2 OLPs",
                # "Operated also as Fullstack and DevOps engineer, from 0 to prod",
                # "System made ₱ 1 MLN loan approved @ first 2 weeks in production",
                # "Implemented code quality code review and CI standards over the organization",
            ],
            "responsibilities": [
                "Technical Strategy",
                "Архитектура и технические решения на бэкэнде",  # Архитектура и технические решения на бэкэнде
                "Full-Stack разработка",
                "Интеграция LLM AI",  # Интеграция с LLM AI
                "DevOps",
                "Отказоустойчивость системы",  # Развёртывание, Системное администрирование, Поддержка CI-CD
                "Техническое лидерство",  # Контроль качества и техническое лидерство
                "Контроль качества ПО",
                "Внесение изменений в процесс разработки",  # Нововведенияв рабочий процесс
                # "architecture", #
                # "development", # Разработка бэкэнд и веб фронтенд
                "Скрининг откликов кандидатов",
                "Проведение технических интервьюпри найме",  # Техническое интервью и найм
                "развертывание dev/prod контуров",  #
                "CI/CD конфигурация и сопровождение",
                "Менторинг",  # Помощь ближнему
                "Code review",  # Код ревью
                "DBA: авто-бэкапы, восстановления, репликация бд",  # DBA, setup, backup, restore, replication
            ],
            "skills": [
                "C4 model",
                "LangChain",
                "FastAPI",
                "Python",
                "RAG",
                "FAISS",
                "sentence-transformers",
                "HuggingFace",
                "JavaScript",
                "React.js",
                "Django",
                "Django Rest Framework (DRF)",
                "Golang",
                "Dart",
                "Flutter",
                "Ansible",
                "Linux",
                "Bash",
                "Streamlit",
                "Docker",
                "RabbitMQ",
                "Postgresql",
                "Firebase",
                "AWS S3",
                "Splunk",
                "Sentry",
                "Prometheus",
                "Grafana",
                "Hashicorp Vault",
                "PromQL",
                "Redis",
                "RPC",
                "JsonRPC",
                "websocket",
                "pytest",
                "vcrpy",
                "BDD",
                "Gherkin",
                "unittest",
                "behave-testing",
                "gitlab-ci",
                "pg_logical",
                "SonarQube",
                "Firebase",
                "Elasticsearch",
                "ELK",
                "KQL",
                "Filebeat",
                "PowerBi",
                "jsCPD",
                "Precommit",
                "SonarQube",
                "UiAutomator2",
                "playwright",
                "nextcloud",
                "nginx",
                "appium",
                "kotlin",
                "pgbouncer",
                "flowpipe",
                "load testing",
                "locust",
                "mixtral",
                "phi3",
                "plantuml",
                "Keycloak",
                "coturn",
            ],
        },
        {
            # ✅
            "company_name": "Innopolis University, refresher courses centre",
            "company_contacts": "https://innopolis.university/dpo-courses/",
            "company_contacts_link": "https://stc.innopolis.university",
            "work_start_date": "05-2020",
            "work_end_date": "11-2023",
            "position_name": "Преподаватель it курсов повышения квалификации",
            "description": """
            Разработал материалы и преподавал лекции для сотрудников “Ак Барс Центр Технологий” и "Ростелеком" а также в рамках федерального проекта "Передовые Инженерные Школы".
            Выпускники курсов уже работают на middle/senoir позициях.
            Подготовил и провёл блок курса для QA специалистов, блок курса для DevOps инженеров, курс для backend программистов, блок курса по анализу данных и машинному обучению.
            На сегодняшний момент обучил уже более 300 работников, которые ныне работают в it.
            """,
            "action_points": [
                "Преподавал на 7 курсах для 4 компаний по тематике Python, DevOps, QA, Data Science",
                "Обучил более 300 сотрудников которые работают на грейде mid+ и выше",
                "Провёл не менее 180 вебинаров и составил 3 учебных плана",
            ],
            "responsibilities": [
                "Проведение вебинаров",
                "Приёмка экзаменов",
                "Создание практических упражнений",
                "Создание учебных планов",
            ],
            "skills": [
                "Python",
                "pytest",
                "unittest",
                "Flask",
                "Django",
                "Django Rest Framework (DRF)",
                "JavaScript",
                "TeamCity",
                "RabbitMQ",
                "Redis",
                "postgresql",
                "Docker",
                "nginx",
                "docker-compose",
                "postgresql",
                "mongodb",
                "pandas",
                "sklearn",
                "probstat",
                "matplotlib",
                "seaborn",
                "machine lerning",
                "neural networks",
                "data analysis",
                "streamlit",
                "Ansible",
                "TestRail",
                "gitlab-ci",
                "Elasticsearch",
                "selenium",
                "playwright",
                "fiddler",
                "postman",
                "JavaScript",
                "nginx",
                "ELK",
                "Sentry",
            ],
            "video_links": [
                "https://youtu.be/L3JiJwwkECw",
                "https://youtu.be/OGyDhKET7nA",
                "https://youtu.be/x51PjXu4HxY",
            ],
        },
        {
            # ❌❌
            "company_name": "Instamart Technologies",
            "company_contacts": "SBERmarket / Kuper",
            "company_contacts_link": "https://sbermarket.ru/instamart-technologies-it",
            "work_start_date": "12-2021",
            "work_end_date": "08-2022",
            "position_name": "Python Разработчик",
            "description": """
            Купер (ранее - сбермаркет) часть экосистемы СБЕРа.
            

            * Разрабатывал бэкэнд (с RestApi) веб сервисов внутреннего пользования; Прототипирование и разработка архитектуры веб проектов, разработка моделей БД
            * Декомпозировал задачи, распределял задачи для членов команды (занимался организацией работы для бэкэнд разработчиков)
            * Проводил ВСЕ scrum - мероприятия (Планирование, ретро, груминг, ...)
            * Проводил код-ревью
            * Занимался обучением/менторством менее опытных коллег
            * Занимался консультированием команд подрядчиков (в т.ч. проводил код-ревью)
            * Проводил переговоры с разработчиками смежных команд по технической реализации интеграции сервисов, описывал документацию ожидаемого api
            * Мониторил уже запущенные в эксплуатацию сервисы
            """,
            "action_points": [
                "Разработал 5 внутренних сервисов для сотрудников",
                "Проводил все SCRUM активности",
                "Распределял задачи между бэкенд-разработчиками в команде",
            ],
            "responsibilities": [
                "разработка",
                "менторство",
                "code review",
                "взаимодействие с другими командами в организации",
                "проведение SCRUM событий",
                "распределение задач между разработчиками",
            ],
            "skills": [
                "Python",
                "Django",
                "Django Rest Framework (DRF)",
                "FastAPI",
                "Wagtail",
                "Docker",
                "Kubernetes",
                "Postgresql",
                "Rabbitmq",
                "Redis",
                "Kafka",
                "grpc",
                "keycloak",
                "Nexus OSS",
                "protobuf",
                "Hashicorp Vault",
                "fitz",
                "Grafana",
                "PromQL",
                "Precommit",
                "SonarQube",
                "tox",
                "gitlab-ci",
                "NetworkX",
                "treebeard",
                "sentry",
                "ELK",
                "KQL",
                "pytest",
                "vcrpy",
            ],
        },
        {
            # ✅
            "company_name": "Университет Иннополис | Центр Гео Информационных Систем",
            "company_contacts": "проект Teleagronom",
            "company_contacts_link": "https://teleagronom.com",
            "work_start_date": "11-2020",
            "work_end_date": "04-2022",
            "position_name": "Python Разработчик",
            "description": """
            Центр ГИС занимается research-and-develop в университете Иннополис и разрабатывает географические онлайн системы.

            Работал над двумя проектами: КСДМ и телеагроном

            КСДМ:
            1. Реализовал бэкэнд геоинформационной системы по мониторингу данных ДЗЗ для правительственных органов субъектов приволжского федерального округа.

            телеагроном:
            1. Разработал бэкэнд для системы прогнозирования возникновения вредных объектов и дат полевых работ на сельскохозяйственных полях для министерства сельского хозяйства Мордови и агропредприятий.
            2. Проводил переговоры с разработчиками сторонней организации по технической реализации интеграции сервисов, описывал документацию ожидаемого api
            3. Менторил менее опытных коллег, проводил code-review

            project url: https://teleagronom.com
            """,
            "action_points": [
                "Реализовал геоинформационную систему используемую правительством",
                "Реализовывал систему сельхоз мониторинга",
                "Переговаривался и реализовывал внешнюю интеграцию с системой партнеров",
                "Менторил менее опытных коллег",
            ],
            "responsibilities": [
                "разработка",
                "CI/CD",
                "Развёртывание",
                "Менторство",
                "unit-тестирование",
                "Code Review",
                "Внешние интеграции",
                "Участие в переговорах с командами подрядчиков по деталям интеграции",
            ],
            "skills": [
                "Python",
                "Airflow",
                "Django",
                "Django Rest Framework (DRF)",
                "FastAPI",
                "Asyncio",
                "Aiohttp",
                "keycloak",
                "postgresql",
                "postGIS",
                "celery",
                "FastAPI",
                "AWS S3",
                "Docker",
                "RabbitMQ",
                "TestRail",
                "Azure DevOps",
                "pandas",
                "matplotlib",
                "seaborn",
                "GeoPandas",
                "data analysis",
                "Shapely",
                "Fiona",
                "tox",
                "nginx",
                "linux",
                "bash",
            ],
        },
        {
            # ✅
            "company_name": "Akvelon | Reddit | growth team",
            "company_contacts": "akvelon.com",
            "company_contacts_link": "https://akvelon.com",
            "work_start_date": "06-2021",
            "work_end_date": "10-2021",
            "position_name": "Senior Python developer (contractor)",
            "description": "Был аустафф бэкэндером для reddit.com. Разрабатывал централизованный индексатор страниц. Сервис осуществляет ограниченную и приоритетную индексацию страниц сайта Reddit для результатов поиска в Google.",
            "action_points": [
                "Разрабатывал централизованный индексатор страниц (reddit)",
            ],
            "responsibilities": ["разработка", "unit-тесты", "CI/CD"],
            "skills": [
                "Python",
                "Redis",
                "DroneCI",
                "Docker",
                "pytest",
                "Kubernetes",
                "Baseplate",
                "Thrift",
                "Tilt",
                "Git",
                "linux",
                "bash",
            ],
        },
        {
            # ✅
            "company_name": "X5 RETAIL GROUP | X5 TECH",
            "company_contacts": "x5.ru/en",
            "company_contacts_link": "https://www.x5.ru/en/",
            "work_start_date": "01-2020",
            "work_end_date": "06-2021",
            "position_name": "Python разработчик",
            "description": """
            X5 retail group самый большой ретейлер с 16000 магазинами и 339000 сотрудниками в России.

            Пока работал в X5:
            1. Разрабатывал набор асинхронных микросервисов для омниканальной платформы компании.
            2. Реализовал централизованный сервис хранения данных и учета согласий на обработку данных клиентов, активирующих карты лояльности; Ныне сервис используется как хранение юридических обоснований обработки ПДн.
            3. Реализовал интеграцию с системами быстрых платежей по qr-коду различных банковских операторов;
            4. Участвовал в реализации системы предактивации сим-карт на точках продаж
            5. Участвовал в реализации системы учета текущих остатков товаров в магазинах
            6. Проводил SCRUM-мероприятия
            """,
            "action_points": [
                "Создалболее десятка микросервисов для омниканальной платформы",
                "Выкатил систему которая обработала больше 11 миллионов карт лояльности",
                "Разрабатывал высоконагруженные сервисы для >5000 торговых точек",
            ],
            "responsibilities": [
                "Разработка микросервисов для платформы",
                "Внешние интеграции",
                "Участие в переговорах с командами подрядчиков по деталям интеграции",
                "Создание панелей мониторинга и активное предотвращение сбоев, вызванных высокими нагрузками",
                "Проведение SCRUM мероприятий",
                "Code Review",
            ],
            "skills": [
                "Python",
                "Asyncio",
                "Aiohttp",
                "Redis",
                "Django",
                "Django Rest Framework (DRF)",
                "Celery",
                "sqlalchemy",
                "AWS S3",
                "Kafka",
                "RabbitMQ",
                "pytest",
                "unittest",
                "gitlab-ci",
                "Docker",
                "Docker-compose",
                "Kubernetes",
                "keycloak",
                "OpenShift",
                "OracleDB",
                "IBM-MQ",
                "black",
                "isort",
                "mypy",
                "flake8",
                "cookiecutter",
                "bash",
                "git",
                "tox",
                "SCRUM",
                "linux",
            ],
        },
        {
            # ✅
            "company_name": "InnoCamp",
            "company_contacts": "innopoliscamp.ru",
            "company_contacts_link": "https://innopoliscamp.ru",
            "work_start_date": "12-2019",
            "work_end_date": "06-2020",
            "position_name": "Преподаватель курса",
            "description": """
                InnoCamp - летний лагерь для подростковкоторые хотят программировать. 

                Проводил курсы веб-разработки на Python для подростков (интенсивный курс программирования).
                """,
            "action_points": [
                "Некоторые ученики позже стали студентами тех.специальностей в университете",
            ],
            "responsibilities": [
                "проведение занятий в классе",
                "подготовка учебных материалов (примеры кода, презентации)",
            ],
            "skills": [
                "Python",
                "Flask",
                "postgresql",
                "Telegram bot api",
                "telethon",
                "Jinja2",
                "JavaScript",
            ],
        },
        {
            # ✅
            "company_name": "Университет Иннополис",
            "company_contacts": "innopolis.university",
            "company_contacts_link": "https://innopolis.university/en/",
            "work_start_date": "03-2019",
            "work_end_date": "04-2020",
            "position_name": "Ассистент профессоорра (Teacher's assistant, TA) на курсе 'Виртуализация'",
            "description": """
            Разработал набор лекций и практических задач об инструментах контейнеризации предоставляемых ядром linux (пространства имен namespaces, контрольные группы cgroups), основы docker, kubernetes. Проводил занятия для студентов магистратуры и бакалавриата.
            
            Ссылки на примеры лекционных презентаций:
            1. [Презентация: create your own container in C++](http://tinyurl.com/y5jkz3d6)
            2. [Презентация: Cloud resource scheduling and power management](http://tinyurl.com/mrxharrj)
            3. [Презентация: Docker internals, docker-compose and intro to kubernetes](http://tinyurl.com/33rmrvn9)

            """,
            "action_points": [
                "Провел не менее 20 лекций на английском языке (не родной).",
            ],
            "responsibilities": [
                "проведение аудиторных лекций",
                "подготовка учебных материалов (примеры кода, презентации)",
                "выставление оценок студенческим курсовым работам",
            ],
            "skills": [
                "linux",
                "Docker",
                "Docker-Compose",
                "K8s (Kubernetes)",
                "Cloud architecture",
                "bash",
                "MS Azure",
                "GCP",
                "AWS",
                "VMWare",
                "LXC",
            ],
        },
        {
            # ✅
            "company_name": "Университет Иннополис | Центр облачных технологий и виртуализации",
            "company_contacts": "Сервис ИИ-мониторинга лесоизменений",
            "company_contacts_link": "https://ai.innopolis.university/aiforest/",
            "work_start_date": "08-2018",
            "work_end_date": "01-2020",
            "position_name": "Python Software Engineer",
            "description": """
            Университет Иннополис ведёт Research-And-Development деятельность усилиями своих лабораторий и центров. Центр облачных технологий и виртуализации реализовывал облачную онлайн платформу дистанционного зондирования Земли, с которой интегрировалась моя система.

            Внёс большой вклад в создание системы выявления лесоизменений, путём обработки космоснимков со спутников.
            Система создавалась по заказу Министерства Лесного Хозяйства Республики Татарстан.

            Вместе с написанием кода занимался развёртыванием решения, изменением архитектуры, управлением процесса команды разработки и проведением SCRUM событий. 
            Созданное решение принесло университету более 6 миллионов руб. в 2019 году. Продукт продолжает использоваться и приносить доход в университет.

            ССЫЛКИ НА ПАТЕНТЫ:
            1. https://tinyurl.com/3m58mfmu
            2. https://tinyurl.com/nwx2fuxy

            ссылка на проект: https://ai.innopolis.university/aiforest/
            
            """,
            "action_points": [
                "Реализовал сервисы обрабатывающие >15Гб данных ежедневно",
                "Сервис принёс 6 млн ₽ за первый год",
                "Проводил все SCRUM событий",
                "Интегрировал сервис с более крупной платформой",
                "Менторил одного джуна",
            ],
            "responsibilities": [
                "Разработка бэкэнда",
                "Интеграция с другими системами платформы",
                "Проведение SCRUM событий",
                "Коллаборация с командой DevOps",
            ],
            "skills": [
                "Python",
                "pandas",
                "matplotlib",
                "seaborn",
                "data analysis",
                "GeoPandas",
                "Numpy",
                "GDAL",
                "QGis",
                "pytest",
                "Docker",
                "RabbitMQ",
                "LDAP",
                "Nexus OSS",
                "keycloak",
                "Redis",
                "Docker-compose",
                "Azure cloud",
                "Azure devops CI/CD",
                "flake8",
                "postgresql",
                "postGIS",
                "GeoServer",
                "graphvis",
                "grpc",
                "protobuf",
                "Ansible",
                "awx",
                "rasterio",
                "pyshp/shapely",
                "fiona",
                "fmask",
                "AWS S3",
                "peewee",
                "SCRUM",
                "tox",
                "linux",
                "bash",
            ],
        },
        {
            "company_name": "Tinkoff центр технологий",
            "company_contacts": "tinkoff.ru",
            "company_contacts_link": "https://www.tinkoff.ru/software/tcr/",
            "work_start_date": "01-2018",
            "work_end_date": "07-2018",
            "position_name": "Python разработчик (стажировка / дипломный проект)",
            "description": """
            """,
            "action_points": [
                "Написал на языке python бэкэнд приложения помощи операторам техподдержки. Исправление ошибок с использованием nlu - программной обработки разговорного языка",
            ],
            "responsibilities": [
                "Реализация бэкэнда",
                "Сбор тренировочных данных для  ML модели",
                "Обучение различных моделей, сравнение результатов (a/b)",
                "Контроль за учетом рабочего времени команды",
                "Проведение SCRUM событий",
                "Написание документации",
            ],
            "skills": [
                "Python",
                "nltk",
                "jamspell",
                "Docker",
                "Docker-compose",
                "Git",
                "bash",
                "NLP",
                "NLU",
                "CBow",
                "Falcon",
                "numpy",
                "pandas",
                "SCRUM",
                "linux",
            ],
        },
        {
            # ✅
            "company_name": "АВАКС ГеоСервис",
            "company_contacts": "uav-siberia.com",
            "company_contacts_link": "https://uav-siberia.com",
            "work_start_date": "02-2017",
            "work_end_date": "07-2017",
            "position_name": "C++ разработчик (стажировка / дипломный проект)",
            "description": """
            АВАКС ГеоСервис специализируется на гражданских (не-военных) дронов БПЛА.
            """,
            "action_points": [
                "Разработал плагин к существующей системе управления БПЛА",  # "adding new plugin to existing software",
                "Протестировал свою разработку на реальных данных полёта БПЛА",  # "testing this plugin using real UAV flight data",
                "Изучил специфику работы с дронами, бпла",  # "Got understanding in specifics of working with drones, UAV",
                "Получил практический опыт работы с программированием 3D-графики.",  # "Got practice in programmatic work with 3D graphics",
            ],
            "responsibilities": [
                "Написание плагина для телеметрического ПО",
                "Демонстрация 3д рендера",
                "Оценка трудозатрат",
                "Планирование",
                "Написание документации",
            ],
            "skills": [
                "C++",
                "Qt",
                "CMake",
                "Pangolin",
                "3D graphics",
                "OpenGL",
                "CLion",
                "Git",
                "bash",
                "linux",
                "OOP",
            ],
        },
        {
            # ✅
            "company_name": "ChatBotShop",
            "company_contacts": "[компания закрылась]",
            "company_contacts_link": None,
            "work_start_date": "11-2016",
            "work_end_date": "03-2017",
            "position_name": "jr Python developer",
            "description": """
            ChatBotShop — студия веб-разработки, специализирующаяся на создании веб-сайтов и чат-ботов для бизнес-клиентов.
            """,
            "action_points": [
                "Разрабатывал чат-бот и админ-панель для ресторана в Израиле",
                "Удалось сделать локализацию (i10n)",
            ],
            "responsibilities": [
                "Общение с заказчиком",
                "Добавление новых фич",
                "Оценка трудозатрат на реализацию",
            ],
            "skills": [
                "Python",
                "Django",
                "Django Rest Framework (DRF)",
                "Celery",
                "Postgresql",
                "Telegram bot api",
                "Viber bot api",
                "PyCharm",
                "Git",
                "linux",
                "OOP",
            ],
        },
        {
            # ✅
            "company_name": "Академия дизайна и программирования",
            "company_contacts": "nadip.ru",
            "company_contacts_link": "https://nadip.ru",
            "work_start_date": "09-2016",
            "work_end_date": "02-2017",
            "position_name": "Преподаватель программирования на Python",
            "description": """
            Новосибирская академия дизайна и программирования - учреждение дополнительного образования для школьников. 
            """,
            "action_points": [
                "Разработал материал и преподавал для подростков курс по программированию 2d-игр на python. 2 урока в неделю для 12 учащихся."
                # "Создал новый учебный курс",  # "Produced brand new course for additional education club",
                # "Проводил ауиторные занятия для 12 учеников",  # "Provided offline classes for 12 students",
            ],
            "responsibilities": [
                "Создавание методических материалов уроков",
                "Проведение аудиторных (оффлайн) занятий",
                "Code review",
                "Выставление оценок",
                "Дача обратной связи",
            ],
            "skills": [
                "Python",
                "PyGame",
                "blender",
                "blender game engine",
                "Git",
                "OOP",
                "Code review",
            ],
        },
        {
            # ✅
            "company_name": "Beward cctv systems",
            "company_contacts": "beward.ru",
            "company_contacts_link": "https://www.beward.ru",
            "work_start_date": "06-2016",
            "work_end_date": "08-2016",
            "position_name": "Java Android intern",
            "description": """
            Beward - производитель устройств и программного обеспечения для видеонаблюдения и безопасности.
            """,
            "action_points": [
                "Разработал 3 новых экрана для существующего Android-приложения по настройке системы видеонаблюдения",
                "Получил опыт удаленной работы под руководством компетентного наставника",
                "Ознакомился с жизненным циклом компонентов Android, контекстами, инструментами и принципами мобильного пользовательского интерфейса",  # "Got familiar with android components lifecycles, contexts, tools, UI principles",
                "Использовал сторонние библиотеки для решения задач",  # "Used third party libs to get help with tasks",
            ],
            "responsibilities": [
                "Программная реализация задач, полученных от наставника",  # "Получал задачи от наставника, писал код по ним", #"Got tasks from mentor, write code for them",
                "Работа с обратной связью от наставника",  # "Worked with feedback from mentor",
            ],
            "skills": [
                "java",
                "android",
                "gradle",
                "git",
                "Android Studio",
                "Genymotion",
                "OOP",
            ],
        },
    ],
    "edu": [
        {
            "degree": "Магистратура - Master of Science in IT - Software Engineering",
            "university": "Университет Иннополис",
            "programme": "MSIT- Software Engineering (По учебной программе университета Carnegie Mellon - msit-se.com)",
            "year_start": "2017",
            "year_end": "2018",
            "website": "https://innopolis.university",
            "icon": "https://embit.ru/wp-content/uploads/2023/06/873593.png",
        },
        {
            "degree": "Бакалавриат - Программная инженерия",
            "university": "Сибирский федеральный университет",
            "programme": "Программная инженерия",
            "year_start": "2013",
            "year_end": "2017",
            "website": "https://www.sfu-kras.ru/en",
            "icon": "https://ctftime.org/media/team/1643606799_5-papik-pro-p-sfu-logotip-5_1.png",
        },
    ],
    "spoken_languages": [
        {"name": "Английский", "level": "C1"},
        {"name": "Польский", "level": "A2"},
        # {"name": "Межславянский", "level" : "A2"},
        {"name": "Русский", "level": "Родной"},
    ],
    "projects": [
        {
            "text": "",
            "link": "",
        },
        {
            "text": "",
            "link": "",
        },
        {
            "text": "",
            "link": "",
        },
        {
            "text": "",
            "link": "",
        },
    ],
}
